//! Функцїї (Functions)
//* Функція - це блок кода який можна виконувати багаторазово

// let a = 5;
// let b = 3;

// Однакові блоки кода
// let c = a + b;
// console.log(c);

// a = 8;
// b = 12;
// Однакові блоки кода
// c = a + b;
// console.log(c);

//* Ми можемо це оптимізувати створивши функцію

let d = 4;
let e = 7;

function sum(d, e) {
  const f = d + e;
  console.log(f);
}

sum(d, e);

d = 11;
e = 20;

sum(d, e);

//! Функція може бути:
//* 1 -- іменованою;
//* 2 -- присвоєна змінній;
//* 3 -- анонімна;
//* 4 -- аргументом при виклику іншої функції;
//* 5 -- значенням властивості(методу) об'єкта;
