//! Оператори
// Оператори - це влаштована в JavaScript функція

//* Оператори поділяються на:
//* 1. Унарні оператори - які складаються з одного операнда
//* 2. Бінарні оператори - які складаються з двох і більше операндів

//! Оператори є:
//* 1. Арифметичні(
//-- "+"-додавання,
//-- "-"-віднімання,
//-- "*"-множення,
//-- "/"-ділення)
//* 2. Порівняння(
//-- "==="-строга рівність,
//-- "!=="-не рівність,
//-- "<="- менше рівно
//-- ">="-більше рівно)
//* 3. Логічні(
//-- "!"-логічне "ні",
//-- "&&"-логічне "і",
//-- "||"-логічне "АБО")
//* 4. Присвоєння("=")
