//! Області видимості(scope)
//* Область видимості визначає границі дії змінної

//* 1. Глобальна
//* 2. Блокова(локальна)
//* 3. Функціональна

// Глобальна область видимості(Змінні "a", "b", "c") - можуть мати таке саме ім'я як і в локальній області видимості. Проте - це будуть різні змінні
// Локальна область видимості 1 || Локальна область видимості 2
// Змінна "a", "c"              || Змінна "b"

// Області видимості

// let a;                               // == 1(a) step.
// let b;                       //== 1(b) step.

// function myFunc() {
//   let b;                     //== 3(b) step.
//   a = true;                          // == 3(a) step.
//   b = 10;                    //== 4(b) step.
//   console.log(b); // 10;     //== 5(b) step.
// }                                    // == 2(a) step.
// myFunc();                    //== 2(b) step.
// console.log(a); //true               // == 4(a) step.
// console.log(b); //undefined; //== 6(b) step.

//! Життєвий цикл змінної "b"
//* 1. Оголошуємо "b" в глобальній області видимості. Її значення - "undefined"
//* 2. Викликаємо функцію "myFn()"
//* 3. Оголошуємо "b" в області видимості функції
//* 4. Чи оголошена "b" в області функції? Так. Присвоєння цій змінній "b" значення "10"
//* 5. Виводимо значення змінної "b" в консоль
//* 6. "b" все так же має значення "undefined" у глобальній області видимості

//* Ланцюжок областей видимості

//! Життєвий цикл змінної "a"
//*1. Оголошуємо змінну "a" в глобальній області видимості. Її значення - "undefined"
//* 2. Викликаємо функцію "myFn()"
//* 3. Чи оголошена змінна "a" в зоні видимості функції? Ні. Робимо крок нагору. Оголошена в зовнішній області видимості? Так. Присвоюємо її значення "true" в глобальній області видимості.
//* 4. "a" має значення "true"
// const a = 5;

// function myFn() {
//   function innerFn() {
//     console.log(a); //5
//   }
//   innerFn();
// }
// myFn();

// 1. Global scope
// 2. myFn scope
// 3. inner scope(a?)

//TODO == Типи областей видимості
//* 1. Глобальна область видимості
//* 2. Функціональна область видимості
//* 3. Блокова область видимості(це будь-який блок який знаходиться між фігурними дужками)

function myFun() {
  a = true;
  //Змінна "a" буде автоматично оголошена в глобальній області видимості
  console.log(a); //true;
}
myFun(); //true;
