//! Типи змінних
//* Тип змінної визначається типом присвоєного йому значення

const a = 10;
//* 10 - це число(number)
const b = "abc";
//* abc - це стрічка(string)

//! Усі типи змінних поділяється на: примітивні та посилальний
// -- примітивні типи(number, string, boolean, null, undefined, symbol)
// -- посилальнмй тип(object)

//* Змінна
//* Має значення
//* Значення має тип

//* Значення примітивних типів
// Пам'ять
//"Hello world" | undefined
//true          | 25
// Коли ми записуємо такі змінні то в пам'яті ПК вони будуть містити значення

//* Посилальний тип
// Тобто при присвоєні змінній об'єкта, вона буде зберігати в собі лише посилання на даний об'єкт. Тобто сам об'єкт буде зберігатись в іншій коміркі пам'яті ПК
// Пам'ять
// 0x3151       | {a:10, b:true}
// 0x7213       | [1,2,3]

// 0x3151       | {a:10, b:true}
// 0x7213       |

const objectA = { a: 10, b: true };

const copyOfA = objectA;

//* Доступ до даного об'єкта можливо через метод "."
copyOfA.a = 20;

// Додавати нові властивості можливо у такий спосіб
copyOfA.c = "abc";
console.log(objectA);

//! Якщо працюємо з консолею браузера, потрібно завжди очищати її за допомогою комбінації клавіш (Ctrl + R), або закривати її і повторно відкривати. Тому що за допомогою значка у браузері, очищається лише дана консоль. Тобто при викориристані однакових імен зміних, браузер видасть помилку,через те що консоль зберігає діючу сесію.
