//! Класи та прототипи

//* Синтаксис класів з'явився в ES6

// Класи дозволяють створювати "прототипи" для об'єктів
// На основі прототипів створюються "екземпляри" класів
// "Екземпляри" можуть мати свою власні властивості та методи
// "Екземпляри" наслідують властивості та методи "прототипів"

// ========Example===========================================

class Comment {
  constructor(text) {
    this.text = text;
    this.votesQty = 0;
  }

  upvote() {
    this.votesQty = this.votesQty + 1;
  }

  downvote() {
    this.votesQty = this.votesQty - 1;
  }
}

const firstComment = new Comment("First comment");
console.log(firstComment);

// "constructor" - викликається тільки тоді, коли ми створюємо новий екземпляр(New) класу
// Проте інші методи будуть наслідувати
// зміна "this" вказує на екземпляр класу

//* Створити новий коментар можливо викликавши метод "New" на екземплярі класу
