//! Оператори
// Оператори - це влаштована в JavaScript функція

//* Оператори поділяються на:
//* 1. Унарні оператори - які складаються з одного операнда
//* 2. Бінарні оператори - які складаються з двох і більше операндів

//! Оператори є:
//TODO :
//* == 1. Символьні

//* 1.1. Арифметичні(
//-- "+"-додавання,
//-- "-"-віднімання,
//-- "*"-множення,
//-- "/"-ділення)

//* 1.2. Порівняння(
//-- "==="-строга рівність,
//-- "!=="-не рівність,
//-- "<="- менше рівно
//-- ">="-більше рівно)

//* 1.3. Логічні(
//-- "!"-логічне "ні",
//-- "&&"-логічне "і",
//-- "||"-логічне "АБО")

//* 1.4. Присвоєння("=")

//* == 2. Текстові:
// -- "typeof" - оператор, який показує який тип того чи іншого значення
// -- "instanceof" - оператор, який показує до якого класу належить об'єкт
// -- "new" - оператор класу, яки створює екземпляр об'єкта
// -- "delete" - оператор який видаляє властивість з об'єкта

//============================================================================
// let a, b; // оператор "кома(,)" - за допомогою цього оператору можна оголосити пару змінних в JS

// a = 10; // оператор "присвоєння(=)" - можна присвоїти змінній то чи інше значення
// b = a;

// let c = a + b;
// console.log(c); //20

//! Оператор - це вбудована функція
// a = 10; // Оператор "присвоєння" має два операнди(лівий та правий)
// Змінна "а"
// Вираз "10"

//* Внутрішня функція яка має ім'я "="
//! function =(змінна, вираз){
//     1. Отримання результату виразу
//     2. Пошук змінної по імені
//     3. Присвоєння результату виразу змінній
//     4. Повернення результату виразу
// }

//! Операнди
// Операнди - це те що знаходиться зліва або справа від оператора
// Операнди - це аргументи які передаються у внутрішню функцію

//! Унарні оператори
//* У унарних операторів завжди лише один операнд(аргумент)

// b++; // оператор який збільшує значення на "1"
// +b; // оператор який можна конвертувати "стрічку" в "число"
// delete obj.b;
// typeof b;
// new Object(); // оператор "new" за допомогою якого можна створити новий екземпляр того чи іншого об'єкта

//! Бінарні оператори
//* У бінарних операторів два або більше операнда(аргументу)

// c = 6;
// c + a;
// c += 14; // оператор "+=" - це оператор збільшення значення
// c === a; // оператор "===" - оператор строгої рівності(порівнює як тип так і значення)
// c && a;

//! Інфіксний запис
//* Інфіксний запис - означає, що оператор знаходиться "між" операндами

// a = true;
// a + b;
// a += 5;
// a || b;
// a > b;

//! Префіксний запис
//* Префіксний запис - означає, що оператор знаходиться "перед" операндом

// ++b;
// delete obj.b;
// typeof b;

//! Постфіксний запис
//* Постфіксний запис - означає, коли оператор знаходиться "за" операндом

// a++;
// myFunction(): // виклик функції або оператор "()" - який знаходиться "за" операндом myFunction
// - myFunction -це операнд
// - () - це оператор

//! Пріоритети операторів

// a + (b * c) / d - e;

// 1. (b * c);
// 2. (b * c) / d;
// 3. a + (b * c / d);
// 4. a + (b * c / d) - e

// a + (b * c) / (d - e); // можна використати "()" - для того щоб візуально відділити одну дію від іншої

// ((a + b) * c) / d - e;
