//! Типи змінних
//* Тип змінної визначається типом присвоєного йому значення

const a = 10;
//* 10 - це число(number)
const b = "abc";
//* abc - це стрічка(string)

//! Усі типи змінних поділяється на: примітивні та посилальний
// -- примітивні типи(number, string, boolean, null, undefined, symbol)
// -- посилальнмй тип(object)

//* Змінна
//* Має значення
//* Значення має тип

//* Значення примітивних типів
// Пам'ять
//"Hello world" | undefined
//true          | 25
// Коли ми записуємо такі змінні то в пам'яті ПК вони будуть містити значення

//* Посилальний тип
// Пам'ять
// 0x3151       | {a:10, b:true}
// 0x7213       | [1,2,3]
