//! Інструкції (Кожну інструкцію потрібно обов'язково завершувати ";". Крім умовних інструкцій "if else" та циклів, які закінчуються на "{}". Тому що, це блок інструкцій)

//* Вираз - завжди повертає значення(наприклад "=")

//* Інструкції - наприклад коли оголошуємо зміну за допомогою "let a"(Виконує деякі дії)

// let a;
// const b = 5;

// if (a > b) {
//   console.log("a is larger");
// }

// for (let i = 0; i < 5; i += 1) {
//   console.log(i);
// }

//* Вираз-інструкція(expression-statements)

// "abc";
// a = a + 3;
// c = a + b;
// d = "Good" + "Evening";
// myFunction(c, d);
// console.log("Hey");

//! Крапку з комою(";") можна пропускати

// Вираз може бути інструкцією

//* Вираз може бути використане як аргумент у виклику функції

// function myFn(a) {
//   console.log(a);
// }

// const b = true;
// let c = 10;

// myFn(2 + 3); // 5
// myFn(b); // true
// myFn((c = c + 1)); // 11
// =============================================================
// Uncaught syntax error: Unexpected token ";"

// myFn((c = c + 1;)
// myFn(let d)
