//! Глобальні об'єкти
//* -- (window) - об'єкт який знаходиться в браузері
//* -- (global) - об'єкт який присутній в node.js

// Для того щоб не змішувати ці об'єкти вирішили створити універсальний об'єкт
//* -- (globalThis) - уніфікований глобальний об'єкт

//! Властивості глобальних об'єктів
// console - властивість глобальних об'єктів або браузера або node.js
//* -- (window.console);
//* -- (global.console);

//! Метод - це властивість об'єкта значенням якого є функція

// const myCity = {
//   city: "New York",
//   cityGreeting: function () {
//     console.log("Greetings!!");
//   },
// };

// myCity.cityGreeting();
//* Скорочений запис метода об'єкта

// const myCity1 = {
//   city: "Miami",
//   cityGreeting() {
//     console.log("You-ho!!");
//   },
// };

// myCity1.cityGreeting();

//* Методи та властивості об'єкта відрізняються лише тим,

// : - myCity1.city -- властивість об'єкта достається через крапку
// : - myCity.cityGreeting() - для того щоб використати саме метод об'єкта потрібно обов'язково викликати його(функцію) за допомогою "()"
