//! Області видимості(scope)
//* Область видимості визначає границі дії змінної

//* 1. Глобальна
//* 2. Блокова(локальна)
//* 3. Функціональна

// Глобальна область видимості(Змінні "a", "b", "c") - можуть мати таке саме ім'я як і в локальній області видимості. Проте - це будуть різні змінні
// Локальна область видимості 1 || Локальна область видимості 2
// Змінна "a", "c"              || Змінна "b"

// Області видимості

// let a;
// let b;

// function myFunc() {
//   let b;
//   a = true;
//   b = 10;
//   console.log(b); // 10
// }
// myFunc();
// console.log(a); //true
// console.log(b); //undefined

//! Життєвий цикл змінної "b"
//* 1. Оголошуємо "b" в глобальній області видимості. Її значення - "undefined"

//* Ланцюжок областей видимості

// const a = 5;

// function myFn() {
//   function innerFn() {
//     console.log(a); //5
//   }
//   innerFn();
// }
// myFn();

// 1. Global scope
// 2. myFn scope
// 3. inner scope(a?)
